     A*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
     A* test04 — fixed-format subfile with conditioning
     A*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
     A          R EMPSFL                      SFL
     A            EMPNO          6A     O   6  2
     A            EMPNAME       30A     O   6 10
     A            SALARY         9S 2   O   6 42  EDTCDE(1)
     A          R EMPCTL                      SFLCTL(EMPSFL)
     A                                        SFLPAG(15)
     A                                        SFLSIZ(200)
     A                                        TEXT('Employee List')
     A                                        CF03(03)
     A                                        CF06(06)
     A                                        CF12(12)
     A  01                                    SFLDSP
     A                                        SFLDSPCTL
     A            SFLRCDNBR      4S 0  H
     A                                   1 30'EMPLOYEE LIST'
     A                                   3  2'Number'
     A                                   3 10'Name'
     A                                   3 42'Salary'
